garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F45Q10.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC8GLS2" edc:desc="Gate logic select register 2" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC8GLS2" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="8" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE75">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G3D1N" edc:desc="" edc:mask="0x1" edc:name="G3D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D1T" edc:desc="" edc:mask="0x1" edc:name="G3D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D2N" edc:desc="" edc:mask="0x1" edc:name="G3D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D2T" edc:desc="" edc:mask="0x1" edc:name="G3D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D3N" edc:desc="" edc:mask="0x1" edc:name="G3D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D3T" edc:desc="" edc:mask="0x1" edc:name="G3D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D4N" edc:desc="" edc:mask="0x1" edc:name="G3D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D4T" edc:desc="" edc:mask="0x1" edc:name="G3D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC8G3D1N" edc:desc="" edc:mask="0x1" edc:name="LC8G3D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC8G3D1T" edc:desc="" edc:mask="0x1" edc:name="LC8G3D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC8G3D2N" edc:desc="" edc:mask="0x1" edc:name="LC8G3D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC8G3D2T" edc:desc="" edc:mask="0x1" edc:name="LC8G3D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC8G3D3N" edc:desc="" edc:mask="0x1" edc:name="LC8G3D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC8G3D3T" edc:desc="" edc:mask="0x1" edc:name="LC8G3D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC8G3D4N" edc:desc="" edc:mask="0x1" edc:name="LC8G3D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC8G3D4T" edc:desc="" edc:mask="0x1" edc:name="LC8G3D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC8GLS3" edc:desc="Gate logic select register 3" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC8GLS3" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="8" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE76">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G4D1N" edc:desc="" edc:mask="0x1" edc:name="G4D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D1T" edc:desc="" edc:mask="0x1" edc:name="G4D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D2N" edc:desc="" edc:mask="0x1" edc:name="G4D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D2T" edc:desc="" edc:mask="0x1" edc:name="G4D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D3N" edc:desc="" edc:mask="0x1" edc:name="G4D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D3T" edc:desc="" edc:mask="0x1" edc:name="G4D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D4N" edc:desc="" edc:mask="0x1" edc:name="G4D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D4T" edc:desc="" edc:mask="0x1" edc:name="G4D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC8G4D1N" edc:mask="0x1" edc:name="LC8G4D1N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC8G4D1T" edc:mask="0x1" edc:name="LC8G4D1T" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC8G4D2N" edc:mask="0x1" edc:name="LC8G4D2N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC8G4D2T" edc:mask="0x1" edc:name="LC8G4D2T" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC8G4D3N" edc:mask="0x1" edc:name="LC8G4D3N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC8G4D3T" edc:mask="0x1" edc:name="LC8G4D3T" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC8G4D4N" edc:mask="0x1" edc:name="LC8G4D4N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC8G4D4T" edc:mask="0x1" edc:name="LC8G4D4T" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLCDATA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLCDATA" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0xE77">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MCL1OUT" edc:mask="0x1" edc:name="MCL1OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MLC2OUT" edc:mask="0x1" edc:name="MLC2OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MLC3OUT" edc:mask="0x1" edc:name="MLC3OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MLC4OUT" edc:mask="0x1" edc:name="MLC4OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MLC5OUT" edc:mask="0x1" edc:name="MLC5OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MLC6OUT" edc:mask="0x1" edc:name="MLC6OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MLC7OUT" edc:mask="0x1" edc:name="MLC7OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MLC8OUT" edc:mask="0x1" edc:name="MLC8OUT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x10" edc:_addr="0xE78"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RX2PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RX2PPS" edc:nzwidth="8" edc:por="---01111" edc:_addr="0xE88">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="RXDT2PPS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RX2PPS" edc:mask="0x1f" edc:name="RX2PPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="RX2PPS0" edc:mask="0x1" edc:name="RX2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX2PPS1" edc:mask="0x1" edc:name="RX2PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX2PPS2" edc:mask="0x1" edc:name="RX2PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX2PPS3" edc:mask="0x1" edc:name="RX2PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX2PPS4" edc:mask="0x1" edc:name="RX2PPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CK2PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CK2PPS" edc:nzwidth="8" edc:por="---01110" edc:_addr="0xE89">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TXCK2PPS"/>
            <edc:LegacyAlias edc:cname="TX2PPS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CK2PPS0" edc:mask="0x1" edc:name="CK2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CK2PPS1" edc:mask="0x1" edc:name="CK2PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CK2PPS2" edc:mask="0x1" edc:name="CK2PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CK2PPS3" edc:mask="0x1" edc:name="CK2PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CK2PPS4" edc:mask="0x1" edc:name="CK2PPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CK2PPS" edc:mask="0x1f" edc:name="CK2PPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SSP2CLKPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="SSP2CLKPPS" edc:nzwidth="8" edc:por="---01001" edc:_addr="0xE8A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SSP2CLKPPS0" edc:mask="0x1" edc:name="SSP2CLKPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP2CLKPPS1" edc:mask="0x1" edc:name="SSP2CLKPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP2CLKPPS2" edc:mask="0x1" edc:name="SSP2CLKPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP2CLKPPS3" edc:mask="0x1" edc:name="SSP2CLKPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP2CLKPPS4" edc:mask="0x1" edc:name="SSP2CLKPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SSP2PPS" edc:mask="0x1f" edc:name="SSP2PPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SSP2DATPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="SSP2DATPPS" edc:nzwidth="8" edc:por="---01010" edc:_addr="0xE8B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SSP2DATPPS0" edc:mask="0x1" edc:name="SSP2DATPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP2DATPPS1" edc:mask="0x1" edc:name="SSP2DATPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP2DATPPS2" edc:mask="0x1" edc:name="SSP2DATPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP2DATPPS3" edc:mask="0x1" edc:name="SSP2DATPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP2DATPPS4" edc:mask="0x1" edc:name="SSP2DATPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SSP2DATPPS" edc:mask="0x1f" edc:name="SSP2DATPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
