garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F45Q10.PIC
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="WDTPSH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="WDTPSH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02448_wdt_windowed_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0xED0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PSCNT" edc:desc="" edc:mask="0xff" edc:name="PSCNT" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PSCNT8" edc:desc="" edc:mask="0x1" edc:name="PSCNT8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT9" edc:desc="" edc:mask="0x1" edc:name="PSCNT9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT10" edc:desc="" edc:mask="0x1" edc:name="PSCNT10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT11" edc:desc="" edc:mask="0x1" edc:name="PSCNT11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT12" edc:desc="" edc:mask="0x1" edc:name="PSCNT12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT13" edc:desc="" edc:mask="0x1" edc:name="PSCNT13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT14" edc:desc="" edc:mask="0x1" edc:name="PSCNT14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT15" edc:desc="" edc:mask="0x1" edc:name="PSCNT15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="WDTPSCNT" edc:desc="" edc:mask="0xff" edc:name="WDTPSCNT" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="WDTPSCNT8" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT9" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT10" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT11" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT12" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT13" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT14" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT15" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="WDTTMR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxx000" edc:name="WDTTMR" edc:nzwidth="8" edc:por="xxxxx000" edc:_modsrc="DOS-02448_wdt_windowed_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0xED1">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PSCNT16" edc:desc="" edc:mask="0x1" edc:name="PSCNT16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT17" edc:desc="" edc:mask="0x1" edc:name="PSCNT17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STATE" edc:desc="" edc:mask="0x1" edc:name="STATE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTTMR" edc:desc="" edc:mask="0x1f" edc:name="WDTTMR" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="WDTPSCNT16" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT17" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTSTATE" edc:desc="" edc:mask="0x1" edc:name="WDTSTATE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTTMR0" edc:desc="" edc:mask="0x1" edc:name="WDTTMR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTTMR1" edc:desc="" edc:mask="0x1" edc:name="WDTTMR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTTMR2" edc:desc="" edc:mask="0x1" edc:name="WDTTMR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTTMR3" edc:desc="" edc:mask="0x1" edc:name="WDTTMR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTTMR4" edc:desc="" edc:mask="0x1" edc:name="WDTTMR4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="CPUDOZE" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="CPUDOZE" edc:nzwidth="8" edc:por="0000-000" edc:_addr="0xED2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DOZE" edc:mask="0x7" edc:name="DOZE" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="DOE" edc:mask="0x1" edc:name="DOE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ROI" edc:mask="0x1" edc:name="ROI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DOZEN" edc:mask="0x1" edc:name="DOZEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IDLEN" edc:mask="0x1" edc:name="IDLEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DOZE0" edc:mask="0x1" edc:name="DOZE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DOZE1" edc:mask="0x1" edc:name="DOZE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DOZE2" edc:mask="0x1" edc:name="DOZE0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="OSCCON1" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-qqqqqqq" edc:name="OSCCON1" edc:nzwidth="8" edc:por="-qqqqqqq" edc:_addr="0xED3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NDIV" edc:mask="0xf" edc:name="NDIV" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="NOSC" edc:mask="0x7" edc:name="NOSC" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NDIV0" edc:mask="0x1" edc:name="NDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NDIV1" edc:mask="0x1" edc:name="NDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NDIV2" edc:mask="0x1" edc:name="NDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NDIV3" edc:mask="0x1" edc:name="NDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOSC0" edc:mask="0x1" edc:name="NOSC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOSC1" edc:mask="0x1" edc:name="NOSC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOSC2" edc:mask="0x1" edc:name="NOSC0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
