garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F45Q10.PIC
        <edc:SFRDef edc:access="nrnnnnnn" edc:cname="FVRCON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu000000" edc:name="FVRCON" edc:nzwidth="8" edc:por="xx000000" edc:_modsrc="DOS-02541_amp_fvr_ts_ctrl_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1" edc:_addr="0xF2C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADFVR" edc:desc="Zero-Cross Detect Positive-going Edge Interrupt Enable" edc:mask="0x3" edc:name="ADFVR" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CDAFVR" edc:mask="0x3" edc:name="CDAFVR" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TSRNG" edc:desc="Zero-Cross Detect Polarity bit" edc:mask="0x1" edc:name="TSRNG" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEN" edc:desc="Zero-Cross Detect Data Output" edc:mask="0x1" edc:name="TSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RDY" edc:mask="0x1" edc:name="RDY" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="Zero-Cross Detect Software Enable bit" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADFVR0" edc:mask="0x1" edc:name="ADFVR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADFVR1" edc:mask="0x1" edc:name="ADFVR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CDAFVR0" edc:mask="0x1" edc:name="CDAFVR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CDAFVR1" edc:mask="0x1" edc:name="CDAFVR1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="FVRRDY" edc:mask="0x1" edc:name="FVRRDY" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FVREN" edc:mask="0x1" edc:name="FVREN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-rn--nn" edc:cname="ZCDCON" edc:desc="ZERO CROSS DETECT CONTROL REGISTER" edc:impl="0xb3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-x0--00" edc:name="ZCDCON" edc:nzwidth="8" edc:por="0-x0--00" edc:_modsrc="DOS-02702_cmp_zxover_ctrl_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1" edc:_addr="0xF2D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="Zero-Cross Detect Negative-going Edge Interrupt Enable" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="Zero-Cross Detect Positive-going Edge Interrupt Enable" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="Zero-Cross Detect Polarity bit" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="Zero-Cross Detect Data Output" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SEN" edc:desc="Zero-Cross Detect Software Enable bit" edc:mask="0x1" edc:name="SEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ZCDINTN" edc:mask="0x1" edc:name="ZCDINTN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ZCDINTP" edc:mask="0x1" edc:name="ZCDINTP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="ZCDPOL" edc:mask="0x1" edc:name="ZCDPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ZCDOUT" edc:mask="0x1" edc:name="ZCDOUT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ZCDSEN" edc:mask="0x1" edc:name="ZCDSEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nnnn-n" edc:cname="DAC1CON0" edc:desc="" edc:impl="0x1c" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0000-0" edc:name="DAC1CON0" edc:nzwidth="8" edc:por="0-0000-0" edc:_modsrc="DOS-02567_dac_nbit_ctrl_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0xF2E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NSS" edc:desc="" edc:mask="0x1" edc:name="NSS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PSS" edc:desc="" edc:mask="0x3" edc:name="PSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="OE2" edc:desc="" edc:mask="0x1" edc:name="OE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OE1" edc:desc="" edc:mask="0x1" edc:name="OE1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DAC1NSS" edc:mask="0x1" edc:name="DAC1NSS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="DAC1PSS0" edc:mask="0x1" edc:name="DAC1PSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DAC1PSS1" edc:mask="0x1" edc:name="DAC1PSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DAC1OE2" edc:mask="0x1" edc:name="DAC1OE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DAC1OE1" edc:mask="0x1" edc:name="DAC1OE1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="DAC1EN" edc:mask="0x1" edc:name="DAC1EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PSS0" edc:mask="0x1" edc:name="PSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSS1" edc:mask="0x1" edc:name="PSS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
