garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F45Q10.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADRESH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADRESH" edc:nzwidth="0x8" edc:por="00000000" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0xF5F">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADRESH" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="ADRESH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADRES8" edc:mask="0x1" edc:name="ADRES8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES9" edc:mask="0x1" edc:name="ADRES9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES10" edc:mask="0x1" edc:name="ADRES10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES11" edc:mask="0x1" edc:name="ADRES11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES12" edc:mask="0x1" edc:name="ADRES12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES13" edc:mask="0x1" edc:name="ADRES13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES14" edc:mask="0x1" edc:name="ADRES14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES15" edc:mask="0x1" edc:name="ADRES15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0xF" edc:beginaddr="0xF60" edc:endaddr="0x1000" edc:regionid="accesssfr">
        <edc:SFRDef edc:access="nrrr-rrr" edc:cname="ADSTAT" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="ADSTAT" edc:nzwidth="8" edc:por="0000-000" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="2" edc:_begin="0xf" edc:_end="0x1e" edc:_addr="0xF60">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADSTAT" edc:desc="" edc:mask="0x7" edc:name="ADSTAT" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADMATH" edc:desc="" edc:mask="0x1" edc:name="ADMATH" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADLTHR" edc:desc="" edc:mask="0x1" edc:name="ADLTHR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADUTHR" edc:desc="" edc:mask="0x1" edc:name="ADUTHR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADAOV" edc:desc="" edc:mask="0x1" edc:name="ADAOV" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADSTAT0" edc:desc="" edc:mask="0x1" edc:name="ADSTAT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADSTAT1" edc:desc="" edc:mask="0x1" edc:name="ADSTAT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADSTAT2" edc:desc="" edc:mask="0x1" edc:name="ADSTAT2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADRPT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADRPT" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="2" edc:_begin="0xf" edc:_end="0x1e" edc:_addr="0xF61">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADRPT" edc:desc="" edc:mask="0xff" edc:name="ADRPT" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADRPT0" edc:desc="" edc:mask="0x1" edc:name="ADRPT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADRPT1" edc:desc="" edc:mask="0x1" edc:name="ADRPT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADRPT2" edc:desc="" edc:mask="0x1" edc:name="ADRPT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADRPT3" edc:desc="" edc:mask="0x1" edc:name="ADRPT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADRPT4" edc:desc="" edc:mask="0x1" edc:name="ADRPT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADRPT5" edc:desc="" edc:mask="0x1" edc:name="ADRPT5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADRPT6" edc:desc="" edc:mask="0x1" edc:name="ADRPT6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADRPT7" edc:desc="" edc:mask="0x1" edc:name="ADRPT7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADCNT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADCNT" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="2" edc:_begin="0xf" edc:_end="0x1e" edc:_addr="0xF62">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCNT" edc:desc="" edc:mask="0xff" edc:name="ADCNT" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCNT0" edc:desc="" edc:mask="0x1" edc:name="ADCNT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCNT1" edc:desc="" edc:mask="0x1" edc:name="ADCNT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCNT2" edc:desc="" edc:mask="0x1" edc:name="ADCNT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCNT3" edc:desc="" edc:mask="0x1" edc:name="ADCNT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCNT4" edc:desc="" edc:mask="0x1" edc:name="ADCNT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCNT5" edc:desc="" edc:mask="0x1" edc:name="ADCNT5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCNT6" edc:desc="" edc:mask="0x1" edc:name="ADCNT6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCNT7" edc:desc="" edc:mask="0x1" edc:name="ADCNT7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="ADSTPT" edc:desc="" edc:name="ADSTPT" edc:nzwidth="0x10" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="2" edc:_begin="0xf" edc:_end="0x1e" edc:_addr="0xF63">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADSTPTL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADSTPTL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02639_adc_sarcore_mp_ctrl_v1_xxK40_8Bit.Module" edc:_refcount="2" edc:_begin="0xf" edc:_end="0x1e" edc:_addr="0xF63">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADSTPTL" edc:desc="" edc:mask="0xff" edc:name="ADSTPTL" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADSTPT0" edc:desc="" edc:mask="0x1" edc:name="ADSTPT0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT1" edc:desc="" edc:mask="0x1" edc:name="ADSTPT1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT2" edc:desc="" edc:mask="0x1" edc:name="ADSTPT2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT3" edc:desc="" edc:mask="0x1" edc:name="ADSTPT3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT4" edc:desc="" edc:mask="0x1" edc:name="ADSTPT4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT5" edc:desc="" edc:mask="0x1" edc:name="ADSTPT5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT6" edc:desc="" edc:mask="0x1" edc:name="ADSTPT6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT7" edc:desc="" edc:mask="0x1" edc:name="ADSTPT7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
