garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F45Q10.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T6TMR" edc:desc="8-bit period timer" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T6TMR" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02458_tmr_mid2_v1_PIC16F188xx.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFAE">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR6"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR6" edc:desc="" edc:mask="0xff" edc:name="TMR6" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T6PR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="T6PR" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-02458_tmr_mid2_v1_PIC16F188xx.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFAF">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PR6"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR6" edc:desc="" edc:mask="0xff" edc:name="PR6" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T6CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T6CON" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02458_tmr_mid2_v1_PIC16F188xx.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFB0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OUTPS" edc:desc="" edc:mask="0xf" edc:name="OUTPS" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="CKPS" edc:desc="" edc:mask="0x7" edc:name="CKPS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T6OUTPS" edc:desc="" edc:mask="0xf" edc:name="T6OUTPS" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="T6CKPS" edc:desc="" edc:mask="0x7" edc:name="T6CKPS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="T6ON" edc:desc="" edc:mask="0x1" edc:name="T6ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T6OUTPS0" edc:desc="" edc:mask="0x1" edc:name="T6OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS1" edc:desc="" edc:mask="0x1" edc:name="T6OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS2" edc:desc="" edc:mask="0x1" edc:name="T6OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS3" edc:desc="" edc:mask="0x1" edc:name="T6OUTPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6CKPS0" edc:desc="" edc:mask="0x1" edc:name="T6CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6CKPS1" edc:desc="" edc:mask="0x1" edc:name="T6CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6CKPS2" edc:desc="" edc:mask="0x1" edc:name="T6CKPS2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OUTPS0" edc:desc="" edc:mask="0x1" edc:name="OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUTPS1" edc:desc="" edc:mask="0x1" edc:name="OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUTPS2" edc:desc="" edc:mask="0x1" edc:name="OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUTPS3" edc:desc="" edc:mask="0x1" edc:name="OUTPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPS0" edc:desc="" edc:mask="0x1" edc:name="CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPS1" edc:desc="" edc:mask="0x1" edc:name="CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPS2" edc:desc="" edc:mask="0x1" edc:name="CKPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR6ON" edc:desc="" edc:mask="0x1" edc:name="TMR6ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T6HLT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T6HLT" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02458_tmr_mid2_v1_PIC16F188xx.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFB1">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x1f" edc:name="MODE" edc:nzwidth="5"/>
              <edc:SFRFieldDef edc:cname="CKSYNC" edc:desc="" edc:mask="0x1" edc:name="CKSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPOL" edc:desc="" edc:mask="0x1" edc:name="CKPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSYNC" edc:desc="" edc:mask="0x1" edc:name="PSYNC" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE3" edc:desc="" edc:mask="0x1" edc:name="MODE3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE4" edc:mask="0x1" edc:name="MODE4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T6MODE" edc:desc="" edc:mask="0x1f" edc:name="T6MODE" edc:nzwidth="5"/>
              <edc:SFRFieldDef edc:cname="T6CKSYNC" edc:desc="" edc:mask="0x1" edc:name="T6CKSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6CKPOL" edc:desc="" edc:mask="0x1" edc:name="T6CKPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6PSYNC" edc:desc="" edc:mask="0x1" edc:name="T6PSYNC" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T6MODE0" edc:desc="" edc:mask="0x1" edc:name="T6MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6MODE1" edc:desc="" edc:mask="0x1" edc:name="T6MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6MODE2" edc:desc="" edc:mask="0x1" edc:name="T6MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6MODE3" edc:desc="" edc:mask="0x1" edc:name="T6MODE3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6MODE4" edc:mask="0x1" edc:name="T6MODE4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="T6CLKCON" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="T6CLKCON" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02458_tmr_mid2_v1_PIC16F188xx.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFB2">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="T6CLK"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:mask="0xf" edc:name="CS" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CS0" edc:mask="0x1" edc:name="CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:mask="0x1" edc:name="CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS2" edc:mask="0x1" edc:name="CS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS3" edc:mask="0x1" edc:name="CS3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T6CS" edc:mask="0xf" edc:name="T6CS" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T6CS0" edc:mask="0x1" edc:name="T6CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6CS1" edc:mask="0x1" edc:name="T6CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6CS2" edc:mask="0x1" edc:name="T6CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6CS3" edc:mask="0x1" edc:name="T6CS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T6RST" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="T6RST" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02458_tmr_mid2_v1_PIC16F188xx.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFB3">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSEL" edc:mask="0x1f" edc:name="RSEL" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RSEL0" edc:mask="0x1" edc:name="RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL1" edc:mask="0x1" edc:name="RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL2" edc:mask="0x1" edc:name="RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL3" edc:mask="0x1" edc:name="RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL4" edc:mask="0x1" edc:name="RSEL0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T6RSEL" edc:mask="0x1f" edc:name="T6RSEL" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T6RSEL0" edc:mask="0x1" edc:name="T6RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6RSEL1" edc:mask="0x1" edc:name="T6RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6RSEL2" edc:mask="0x1" edc:name="T6RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6RSEL3" edc:mask="0x1" edc:name="T6RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6RSEL4" edc:mask="0x1" edc:name="T6RSEL0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T4TMR" edc:desc="8-bit period timer" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T4TMR" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02458_tmr_mid2_v1_PIC16F188xx.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFB4">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR4"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR4" edc:desc="" edc:mask="0xff" edc:name="TMR4" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T4PR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="T4PR" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-02458_tmr_mid2_v1_PIC16F188xx.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFB5">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PR4"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR4" edc:desc="" edc:mask="0xff" edc:name="PR4" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T4CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T4CON" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02458_tmr_mid2_v1_PIC16F188xx.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFB6">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OUTPS" edc:desc="" edc:mask="0xf" edc:name="OUTPS" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="CKPS" edc:desc="" edc:mask="0x7" edc:name="CKPS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T4OUTPS" edc:desc="" edc:mask="0xf" edc:name="T4OUTPS" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="T4CKPS" edc:desc="" edc:mask="0x7" edc:name="T4CKPS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="T4ON" edc:desc="" edc:mask="0x1" edc:name="T4ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T4OUTPS0" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS1" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS2" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS3" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4CKPS0" edc:desc="" edc:mask="0x1" edc:name="T4CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4CKPS1" edc:desc="" edc:mask="0x1" edc:name="T4CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4CKPS2" edc:desc="" edc:mask="0x1" edc:name="T4CKPS2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OUTPS0" edc:desc="" edc:mask="0x1" edc:name="OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUTPS1" edc:desc="" edc:mask="0x1" edc:name="OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUTPS2" edc:desc="" edc:mask="0x1" edc:name="OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUTPS3" edc:desc="" edc:mask="0x1" edc:name="OUTPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPS0" edc:desc="" edc:mask="0x1" edc:name="CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPS1" edc:desc="" edc:mask="0x1" edc:name="CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPS2" edc:desc="" edc:mask="0x1" edc:name="CKPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR4ON" edc:desc="" edc:mask="0x1" edc:name="TMR4ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
