garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F45Q10.PIC
        <edc:SFRDef edc:access="----nnnn" edc:cname="T2CLKCON" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="T2CLKCON" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02458_tmr_mid2_v1_PIC16F188xx.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFBE">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="T2CLK"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:mask="0xf" edc:name="CS" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CS0" edc:mask="0x1" edc:name="CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:mask="0x1" edc:name="CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS2" edc:mask="0x1" edc:name="CS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS3" edc:mask="0x1" edc:name="CS3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T2CS" edc:mask="0xf" edc:name="T2CS" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T2CS0" edc:mask="0x1" edc:name="T2CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2CS1" edc:mask="0x1" edc:name="T2CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2CS2" edc:mask="0x1" edc:name="T2CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2CS3" edc:mask="0x1" edc:name="T2CS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T2RST" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="T2RST" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02458_tmr_mid2_v1_PIC16F188xx.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFBF">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSEL" edc:mask="0x1f" edc:name="RSEL" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RSEL0" edc:mask="0x1" edc:name="RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL1" edc:mask="0x1" edc:name="RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL2" edc:mask="0x1" edc:name="RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL3" edc:mask="0x1" edc:name="RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL4" edc:mask="0x1" edc:name="RSEL0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T2RSEL" edc:mask="0x1f" edc:name="T2RSEL" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T2RSEL0" edc:mask="0x1" edc:name="T2RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2RSEL1" edc:mask="0x1" edc:name="T2RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2RSEL2" edc:mask="0x1" edc:name="T2RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2RSEL3" edc:mask="0x1" edc:name="T2RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2RSEL4" edc:mask="0x1" edc:name="T2RSEL0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="TMR5" edc:desc="Joined 16-bit Timer" edc:name="TMR5" edc:nzwidth="0x10" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFC0"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR5L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR5L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFC0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR5L" edc:mask="0xff" edc:name="TMR5L" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR5L0" edc:mask="0x1" edc:name="TMR5L0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5L1" edc:mask="0x1" edc:name="TMR5L1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5L2" edc:mask="0x1" edc:name="TMR5L2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5L3" edc:mask="0x1" edc:name="TMR5L3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5L4" edc:mask="0x1" edc:name="TMR5L4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5L5" edc:mask="0x1" edc:name="TMR5L5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5L6" edc:mask="0x1" edc:name="TMR5L6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5L7" edc:mask="0x1" edc:name="TMR5L7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TMR50" edc:mask="0x1" edc:name="TMR50" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR51" edc:mask="0x1" edc:name="TMR51" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR52" edc:mask="0x1" edc:name="TMR52" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR53" edc:mask="0x1" edc:name="TMR53" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR54" edc:mask="0x1" edc:name="TMR54" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR55" edc:mask="0x1" edc:name="TMR55" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR56" edc:mask="0x1" edc:name="TMR56" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR57" edc:mask="0x1" edc:name="TMR57" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR5H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR5H" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFC1">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR5H" edc:mask="0xff" edc:name="TMR5H" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR5H0" edc:mask="0x1" edc:name="TMR5H0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5H1" edc:mask="0x1" edc:name="TMR5H1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5H2" edc:mask="0x1" edc:name="TMR5H2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5H3" edc:mask="0x1" edc:name="TMR5H3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5H4" edc:mask="0x1" edc:name="TMR5H4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5H5" edc:mask="0x1" edc:name="TMR5H5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5H6" edc:mask="0x1" edc:name="TMR5H6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5H7" edc:mask="0x1" edc:name="TMR5H7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TMR58" edc:mask="0x1" edc:name="TMR58" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR59" edc:mask="0x1" edc:name="TMR59" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR510" edc:mask="0x1" edc:name="TMR510" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR511" edc:mask="0x1" edc:name="TMR511" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR512" edc:mask="0x1" edc:name="TMR512" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR513" edc:mask="0x1" edc:name="TMR513" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR514" edc:mask="0x1" edc:name="TMR514" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR515" edc:mask="0x1" edc:name="TMR515" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nn-nnn" edc:cname="T5CON" edc:desc="" edc:impl="0x37" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uu-u0u" edc:name="T5CON" edc:nzwidth="8" edc:por="--00-000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFC2">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR5CON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RD16" edc:desc="" edc:mask="0x1" edc:name="RD16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NOT_SYNC" edc:desc="" edc:mask="0x1" edc:name="NOT_SYNC" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CKPS" edc:desc="" edc:mask="0x3" edc:name="CKPS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR5ON" edc:mask="0x1" edc:name="TMR5ON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5RD16" edc:mask="0x1" edc:name="T5RD16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOT_T5SYNC" edc:mask="0x1" edc:name="NOT_T5SYNC" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="T5CKPS0" edc:desc="" edc:mask="0x1" edc:name="T5CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5CKPS1" edc:desc="" edc:mask="0x1" edc:name="T5CKPS1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="nSYNC" edc:mask="0x1" edc:name="nSYNC" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CKPS0" edc:mask="0x1" edc:name="CKPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKPS1" edc:mask="0x1" edc:name="CKPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RD165" edc:desc="" edc:mask="0x1" edc:name="RD165" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="nT5SYNC" edc:mask="0x1" edc:name="nT5SYNC" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnr--" edc:cname="T5GCON" edc:desc="" edc:impl="0xfc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuux--" edc:name="T5GCON" edc:nzwidth="8" edc:por="00000x--" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFC3">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR5GCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="GVAL" edc:desc="" edc:mask="0x1" edc:name="GVAL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GGO" edc:desc="" edc:mask="0x1" edc:name="GGO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GSPM" edc:desc="" edc:mask="0x1" edc:name="GSPM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GTM" edc:desc="" edc:mask="0x1" edc:name="GTM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GPOL" edc:desc="" edc:mask="0x1" edc:name="GPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GE" edc:desc="" edc:mask="0x1" edc:name="GE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="T5GVAL" edc:mask="0x1" edc:name="T5GVAL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5GGO" edc:desc="" edc:mask="0x1" edc:name="T5GGO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5GSPM" edc:mask="0x1" edc:name="T5GSPM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5GTM" edc:mask="0x1" edc:name="T5GTM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5GPOL" edc:mask="0x1" edc:name="T5GPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5GE" edc:mask="0x1" edc:name="T5GE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="NOT_DONE" edc:mask="0x1" edc:name="NOT_DONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="NOT_T5DONE" edc:mask="0x1" edc:name="NOT_T5DONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="GGO_nDONE" edc:mask="0x1" edc:name="GGO_nDONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="T5GGO_nDONE" edc:mask="0x1" edc:name="T5GGO_nDONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
