garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F45Q10.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T5GATE" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T5GATE" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFC4">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR5GATE"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GSS" edc:mask="0x1f" edc:name="GSS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="GSS0" edc:mask="0x1" edc:name="GSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSS1" edc:mask="0x1" edc:name="GSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSS2" edc:mask="0x1" edc:name="GSS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSS3" edc:mask="0x1" edc:name="GSS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSS4" edc:mask="0x1" edc:name="GSS4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T5GSS0" edc:mask="0x1" edc:name="T5GSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5GSS1" edc:mask="0x1" edc:name="T5GSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5GSS2" edc:mask="0x1" edc:name="T5GSS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5GSS3" edc:mask="0x1" edc:name="T5GSS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5GSS4" edc:mask="0x1" edc:name="T5GSS4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T5CLK" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T5CLK" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFC5">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR5CLK"/>
            <edc:LegacyAlias edc:cname="PR5"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:mask="0x1f" edc:name="CS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T5CS0" edc:mask="0x1" edc:name="T5CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5CS1" edc:mask="0x1" edc:name="T5CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5CS2" edc:mask="0x1" edc:name="T5CS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5CS3" edc:mask="0x1" edc:name="T5CS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5CS4" edc:mask="0x1" edc:name="T5CS4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CS0" edc:mask="0x1" edc:name="CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:mask="0x1" edc:name="CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS2" edc:mask="0x1" edc:name="CS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS3" edc:mask="0x1" edc:name="CS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS4" edc:mask="0x1" edc:name="CS4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="TMR3" edc:desc="Joined 16-bit Timer" edc:name="TMR3" edc:nzwidth="0x10" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFC6"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR3L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR3L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFC6">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR3L" edc:mask="0xff" edc:name="TMR3L" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR3L0" edc:mask="0x1" edc:name="TMR3L0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3L1" edc:mask="0x1" edc:name="TMR3L1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3L2" edc:mask="0x1" edc:name="TMR3L2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3L3" edc:mask="0x1" edc:name="TMR3L3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3L4" edc:mask="0x1" edc:name="TMR3L4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3L5" edc:mask="0x1" edc:name="TMR3L5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3L6" edc:mask="0x1" edc:name="TMR3L6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3L7" edc:mask="0x1" edc:name="TMR3L7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TMR30" edc:mask="0x1" edc:name="TMR30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR31" edc:mask="0x1" edc:name="TMR31" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR32" edc:mask="0x1" edc:name="TMR32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR33" edc:mask="0x1" edc:name="TMR33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR34" edc:mask="0x1" edc:name="TMR34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR35" edc:mask="0x1" edc:name="TMR35" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR36" edc:mask="0x1" edc:name="TMR36" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR37" edc:mask="0x1" edc:name="TMR37" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
